app/views/articles/edit.html.erb

    <%= form.label :category_id %>
    <%= form.collection_select :category_id, Category.all, :id, :name, {} %>
---
SELECT "categories".* FROM "categories"