app/views/articles/show.html.erb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
---
<p><b><%= @article.title %></p></b>
<p><%= Author.find_by(id: @article.author_id).name %></p>