app/controllers/articles_controller.rb

  def edit
    @article = Article.find_by(id: params["id"])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

  def create
  	Article.create(params["articles"])
---
INSERT INTO "articles" DEFAULT VALUES

  def show
  	@article = Article.find_by(id: params["id"])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]