app/controllers/sessions_controller.rb

  def create
    # params["email"] => the email address
    # params["password"] => the password

    @user = User.find_by(email: params["email"])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "nk.milind@gmail.com"]]